Documents/ВводНачальныхОстатковОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОбъектыИмущественногоНалога</xr:Item>
				<xr:Item>InformationRegister.СоставОС</xr:Item>
				<xr:Item>InformationRegister.ФиксированныеАктивыУчитываемыеОтдельно</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОбъектыТранспортногоНалога</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОбъектыЗемельногоНалога</xr:Item>
				<xr:Item>InformationRegister.СчетаУчетаОС</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>InformationRegister.СостоянияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>InformationRegister.ГрафикиАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаОС</xr:Item>
				<xr:Item>InformationRegister.ОбъектыНалоговогоУчетаФА</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыработкаКоличествоБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикАмортизацииБУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГодовыеГрафикиАмортизацииОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчетуРегл</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомерРегл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскоренияБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеДокументаПринятияКУчетуРегл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакопленнаяАмортизацияБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизациюБУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаПринятияКУчетуРегл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительскоеОС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработкиБУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПринятияКУчетуРегл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходовПоАмортизацииБУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПоступленияРегл</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИспользованияДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяСтоимостьБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДСПоПриобретению</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДСПоРеализации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗатратПоМодернизацииБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовОтРеализацииБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСебестоимостиПриРеализацииБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакФиксированногоАктива</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаНУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыНалоговогоУчетаФА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяСтоимостьНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяСтоимостьПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокПогашенияСтоимостиНУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокПогашенияСтоимостиФА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектИмущественногоНалога</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектТранспортногоНалога</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗемельногоНалога</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводНачальныхОстатковОС/Forms/ФормаРедактированияСтроки/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураПараметров") Тогда
		
		СтруктураПараметров = Параметры.СтруктураПараметров;
		
		ВидимостьНУ = СтруктураПараметров.ВидимостьНУ;
		ВидимостьБУ = СтруктураПараметров.ВидимостьБУ;
		ЭтоНовый    = СтруктураПараметров.ЭтоНовый;
		НомерСтроки = СтруктураПараметров.НомерСтроки;
		
		Если СтруктураПараметров.Свойство("ТекущиеДанные") Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров.ТекущиеДанные);
		КонецЕсли; 	
		
		Если СтруктураПараметров.ЭтоНовый Тогда
			Модифицированность = Истина;
		КонецЕсли; 
		
	КонецЕсли;
	
	ЛиквидационнаяСтоимостьБУ = ?(СтоимостьДляВычисленияАмортизацииБУ > 0, ТекущаяСтоимостьБУ - СтоимостьДляВычисленияАмортизацииБУ, 0);
	
	// Включим предопределенные счета и их субсчета
	УправлениеВнеоборотнымиАктивамиСервер.ОграничитьВыборСчетамиУчетаОС(Элементы.СчетУчетаБУ);
	УправлениеВнеоборотнымиАктивамиСервер.ОграничитьВыборСчетамиУчетаНачисленияАмортизацииОС(Элементы.СчетНачисленияАмортизацииБУ);

	УстановитьВидимость(ЭтаФорма);
	               	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;	
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ПараметрыВопроса = Новый Структура("Отказ", Отказ);
		
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПередЗакрытием", ЭтотОбъект, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0); 
		
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	ИнвентарныйНомерРегл = ОсновноеСредствоПриИзмененииНаСервере(ОсновноеСредство);
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияАмортизацииБУПриИзменении(Элемент)
	УстановитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СрокПолезногоИспользованияБУПриИзменении(Элемент)
	
	Если СрокПолезногоИспользованияБУ <> 0 Тогда
		Если СрокИспользованияДляВычисленияАмортизацииБУ = 0 Тогда
		    СрокИспользованияДляВычисленияАмортизацииБУ = СрокПолезногоИспользованияБУ;
			СрокИспользованияДляВычисленияАмортизацииБУПриИзмененииНаКлиенте();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСтоимостьБУПриИзменении(Элемент)
	ВычислитьРазмерЛиквидационнойСтоимостиНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДляВычисленияАмортизацииБУПриИзменении(Элемент)
	ВычислитьРазмерЛиквидационнойСтоимостиНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СрокИспользованияДляВычисленияАмортизацииБУПриИзменении(Элемент)
	СрокИспользованияДляВычисленияАмортизацииБУПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентАмортизацииБУПриИзменении(Элемент)
	
	Если СпособНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ЛинейныйПроцентом") Тогда
		Если КоэффициентАмортизацииБУ <> 0 Тогда
			СрокИспользованияДляВычисленияАмортизацииБУ = Окр((12/КоэффициентАмортизацииБУ ) * 100, 2);
		Иначе
			СрокИспользованияДляВычисленияАмортизацииБУ = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПродукцииРаботБУПриИзменении(Элемент)
	
	Если ОбъемПродукцииРаботДляВычисленияАмортизацииБУ = 0 Тогда
		ОбъемПродукцииРаботДляВычисленияАмортизацииБУ = ОбъемПродукцииРаботБУ;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакФиксированногоАктиваПриИзменении(Элемент)
	УстановитьВидимость(ЭтаФорма);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьДанные();
	УстановитьВидимость(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	
	ЗаписатьДанные(Отказ);
	
	Если НЕ Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	
	Элементы = Форма.Элементы;

	//Устанавливаем видимость закладки НалоговыйУчет
	Элементы.ГруппаСтраницыНалоговыйУчет.Видимость     = Форма.ВидимостьНУ;
	Элементы.ГруппаСтраницыБухгалтерскийУчет.Видимость = Форма.ВидимостьБУ;
	Элементы.ГруппаСтраницыПрочиеРеквизиты.Видимость   = Форма.ВидимостьБУ;
	
	//Установим доступность для элементов, которых можно управлять доступностью
	Элементы.СрокПолезногоИспользованияБУ.Доступность 	     = Форма.ВидимостьБУ;	
	Элементы.НазваниеДокументаПринятияКУчетуРегл.Доступность = Форма.ВидимостьБУ;
	Элементы.СостояниеПринятияКУчетуРегл.Доступность         = Форма.ВидимостьБУ;
	Элементы.НомерДокументаПринятияКУчетуРегл.Доступность    = Форма.ВидимостьБУ;
	Элементы.СпособПоступленияРегл.Доступность 		         = Форма.ВидимостьБУ;
	                          	
	//В зависимости от выбранного способа начисления амортизации отображаем нужную панель с параметрами для ее расчета
	Если Форма.СпособНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Производственный") Тогда
		Элементы.ГруппаСтраницаПараметрыАмортизации.Видимость = Ложь;
		Элементы.ГруппаСтраницаПараметрыАмортизацииПроизводственныйСпособ.Видимость = Истина;
	Иначе
		Элементы.ГруппаСтраницаПараметрыАмортизации.Видимость = Истина;
		Элементы.ГруппаСтраницаПараметрыАмортизацииПроизводственныйСпособ.Видимость = Ложь;
	КонецЕсли;
	
	// Доступность реквизитов НУ
	Элементы.ГруппаНУ.Доступность		             = Форма.ПризнакФиксированногоАктива;
	Элементы.ТекущаяСтоимостьНУ.Доступность 		 = Форма.ПризнакФиксированногоАктива;		
	Элементы.ПорядокПогашенияСтоимостиНУ.Доступность = Форма.ПризнакФиксированногоАктива;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПередЗакрытием(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьДанные(Параметры.Отказ);
		Закрыть();
	Иначе
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте 
Процедура ЗаписатьДанные(Отказ = Ложь)
	
	Если ЭтоНовый Тогда
		ДанныеДляЗаписи = ВладелецФормы.Объект.ОС.Добавить();
	Иначе
		ДанныеДляЗаписи = ВладелецФормы.Объект.ОС[НомерСтроки];
	КонецЕсли;
	
	Попытка
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ЭтаФорма);
	Исключение
		
		ТекстСообщения = НСтр("ru='Операция не может быть выполнена из-за несоответствия версии или отсутствия строки документа (возможно, строка была изменена или удалена)!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		Отказ = Истина;
		Возврат;
		
	КонецПопытки;
	
	ВладелецФормы.Модифицированность = Истина;
	
	Модифицированность = Ложь;
	ЭтоНовый           = Ложь;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ОсновноеСредствоПриИзмененииНаСервере(ОсновноеСредство)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновноеСредство, "Код").Код;		
КонецФункции

&НаКлиенте
Процедура СрокИспользованияДляВычисленияАмортизацииБУПриИзмененииНаКлиенте()
	
	Если СрокИспользованияДляВычисленияАмортизацииБУ <> 0 Тогда
		
		Если (СпособНачисленияАмортизацииБУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ЛинейныйПроцентом")
			Или (СпособНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ЛинейныйПроцентом")
			И КоэффициентАмортизацииБУ = 0)) Тогда
			КоэффициентАмортизацииБУ = Окр((12/СрокИспользованияДляВычисленияАмортизацииБУ) * 100, 2);
		КонецЕсли;
			
	Иначе
		КоэффициентАмортизацииБУ = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВычислитьРазмерЛиквидационнойСтоимостиНаКлиенте()
	
	ЛиквидационнаяСтоимостьБУ = ?(СтоимостьДляВычисленияАмортизацииБУ > 0, ТекущаяСтоимостьБУ - СтоимостьДляВычисленияАмортизацииБУ, 0);	
	ЛиквидационнаяСтоимостьБУ = ?(ЛиквидационнаяСтоимостьБУ < 0, 0, ЛиквидационнаяСтоимостьБУ);
	
КонецПроцедуры
